{"template":"../src/containers/Post","sharedHashesByProp":{},"data":{"post":{"content":"\n---\n\n## 1. What is leadership, anyway?\n\n> Leadership is the process of creating an environment in which people become empowered.\n\n## 2. Models of leadership style\n\n- *M*: motivation - the trophies or trouble, the push or pull that moves the people involved.\n- *O*: organisation - the existing structure that enables the ideas to be worked through into practice.\n- *I*: ideas or innovation - the seeds, the image of what will become.\n\nWhat Technical Leaders Do\n\n- understanding the problem\n- managing the flow of ideas\n- maintaining quality\n\n## 3. A problem-solving style\n\n### Understanding the problem\n\n- Read the specifications very carefully.\n- Encourage teammates to read the specifications very carefully.\n- Resolve arguments by referring back to the original problem.\n- Seek clarifications and additional information about the specifications from the customer.\n- Refer back to the specifications after work has proceeded for a while, when the implications of the requirements can be better understood.\n\n### Managing the flow of ideas\n\n- Contribute a clever idea to the team.\n- Encourage copying of useful ideas.\n- Elaborate on an idea that a teammate contributed.\n- Drop one's own idea in favour of an idea the team wants to develop.\n- Resist time pressure, and take the time to listen when other people explain their idea.\n- Test ideas contributed by other people.\n- Withhold quick criticism of teammates' ideas, in order to keep the ideas flowing.\n- When you must criticize an idea, make clear that you are criticizing the idea, not the person who offered the idea.\n- Test your own ideas before offering them.\n- When time and labour are running short, stop working on new ideas and just pitch in.\n- Encourage the team to drop ideas that had succeeded earlier, but cannot be extended to the new situation.\n- Revive a dropped idea later, when it has value for another part of the problem.\n\n\n### Maintaining quality\n\n- Measure quality as the project proceeds.\n- Design tools and processes to measure quality as you build a solution.\n- Measure the speed of implementation, compare it to the schedule, and be prepared to change the solution procedure.\n- Step back from the project to refresh your perspective and to assess its viability.\n- Check ideas with the customer before implementing them.\n- Restore morale when an idea collapses\n\n---","data":{"layout":"blog","title":"[BOOK] Becoming A Technical Leader","date":"2019-01-30T00:00:00.000Z","thumbnail":"https://images-na.ssl-images-amazon.com/images/I/510T3Y9382L._SX327_BO1,204,203,200_.jpg","rating":"5","slug":"book-becoming-a-technical-leader"},"isEmpty":false,"excerpt":""}},"path":"blog/post/book-becoming-a-technical-leader"}
