{"template":"../src/containers/Post","sharedHashesByProp":{},"data":{"post":{"content":"\n---\n\n## Chapter 1. What is leadership, anyway?\n\n> Leadership is the process of creating an environment in which people become empowered.\n\n## Chapter 2. Models of leadership style\n\n- _M_: motivation - the trophies or trouble, the push or pull that moves the people involved.\n- _O_: organisation - the existing structure that enables the ideas to be worked through into practice.\n- _I_: ideas or innovation - the seeds, the image of what will become.\n\nWhat Technical Leaders Do\n\n- understanding the problem\n- managing the flow of ideas\n- maintaining quality\n\n## Chapter 3. A problem-solving style\n\n### Understanding the problem\n\n- Read the specifications very carefully.\n- Encourage teammates to read the specifications very carefully.\n- Resolve arguments by referring back to the original problem.\n- Seek clarifications and additional information about the specifications from the customer.\n- Refer back to the specifications after work has proceeded for a while, when the implications of the requirements can be better understood.\n\n### Managing the flow of ideas\n\n- Contribute a clever idea to the team.\n- Encourage copying of useful ideas.\n- Elaborate on an idea that a teammate contributed.\n- Drop one's own idea in favour of an idea the team wants to develop.\n- Resist time pressure, and take the time to listen when other people explain their idea.\n- Test ideas contributed by other people.\n- Withhold quick criticism of teammates' ideas, in order to keep the ideas flowing.\n- When you must criticize an idea, make clear that you are criticizing the idea, not the person who offered the idea.\n- Test your own ideas before offering them.\n- When time and labour are running short, stop working on new ideas and just pitch in.\n- Encourage the team to drop ideas that had succeeded earlier, but cannot be extended to the new situation.\n- Revive a dropped idea later, when it has value for another part of the problem.\n\n### Maintaining quality\n\n- Measure quality as the project proceeds.\n- Design tools and processes to measure quality as you build a solution.\n- Measure the speed of implementation, compare it to the schedule, and be prepared to change the solution procedure.\n- Step back from the project to refresh your perspective and to assess its viability.\n- Check ideas with the customer before implementing them.\n- Restore morale when an idea collapses\n\n## Chapter 4. How Leaders Develop\n\n![alt text](https://vegdave.files.wordpress.com/2014/08/learning_curve.jpg?w=600&h=444 \"Leadership growth chart\")\n\n- Practice makes perfect\n- The great leap forward\n- Falling into the ravine\n- Growth in the real world (like image above)\n- How growth feels\n- The metacycle\n\n## Chapter 5. But I can't because...\n\n### I'm not a leader\n\nThe best designed working groups are those in which leadership comes from everybody, not merely the appointed leaders. Therefore, you need not wait - you should not wait - for an appointment.\n\n### I'm not the leader type\n\nConsider leadership by innovation, by adding a new technique to the group's ways of getting things done. Leadership by innovation fit who lack the charisma and organizational skills. But do remember it is the combination of MOI.\n\n### I'll lose my technical skills\n\nYes, it will happen. And consider it regarding MOI. This means an evolution toward a balance among the three factors.\n\n### I'm in grave danger of growing\n\nIt's not bad to postpone change until circumstances force it upon you.\n\n### I don't want that much power\n\nTechnical leaders possess great power in our society, but they are neither demons nor gods. They are ordinary people who happen to possess an effective approach to problem-solving, an approach based on leadership through innovation. Even without any technical background, other ordinary people can empower themselves and others by mastering some elements of this approach.\n\n## Chapter 6. The three great obstacles to innovation\n\n- Self-blindness, concealing your own behaviour, so you have no chance of changing\n\n- No-Problem Syndrome, convincing you that you already know the answer to all problems\n\n- Belief in the central dogma of academic psychology, blinding you to alternative solutions, even ones you could generate without help from anyone else\n\n## Chapter 7. A tool for developing self-awareness\n\n- Starting now and continuing for three months, spend five minutes each day writing in a personal journal.\n\n- Try to use physical paper.\n\n- It is important to find some method that ensures you write your 5 minutes each day.\n\n- Write everything down and find a format that fits you most. You can start with \"Facts, feelings, findings\" form.\n\n- Take time, review and find your pattern..\n\n## Chapter 8. Developing idea power\n\n- **The problem-solving leader's central dogma**: Any real problem has one more solution, which nobody has found-yet\n\n- **Creative errors**:  In fact, every mistake is a new idea, if seen by a mind prepared to use it.\n\n- **Stolen ideas**: You can take ideas from one person(called \"plagiarising\") or from many(called \"research\").\n\n- **Corrupted, stolen ideas**: Introduce an error in a stolen idea. It might transform the idea into the most creative and valuable one.\n\n- **Copulation**: Putting together two ideas to form a new one that's better than either of their parent.\n\n- **Why ideas seem wicked**: It's not an accident that error, theft, and copulation are the three great strategies for developing ideas. Their fundamental nature is shown by the role they play in the genetics of living systems. By the time, you may have noticed the relationship between the three great idea generators and the three great obstacles to innovation. Lack of self-awareness means that we never notice our errors, so we cannot capture them and convert them to something wonderful. Belief in our own master intelligence means that we would never think to copy the work of someone else, so we cannot benefit from creative theft. And knowing that there is one and only one right solution to every problem makes combining ideas seems foolish, so copulation is ruled out.\n\n## Chapter 9. The vision\n\n- It's not the event that matters, but your reaction to the event.\n- Everybody has failures, if only because their success leads them to fail.\n- Every successful technical leader has a personal vision - It is something worth doing but also a unique part that only you can contribute. That's the key to achieving the vision. Joining a mass movement may keep you going as a person, but it won't keep you going as an innovator.\n- People without vision don't have much influence on other people.\n- Without a personal vision, no leadership skill or secret will do you any good. Without a vision, at the leading edge of technology, people and projects perish.\n\n## Chapter 10. The first great obstacle to motivating others\n\n### Testing Yourself\n\n1. Ask you willing to appear foolish in front of other people\n2. If you cann't tolerate being a public fool, you're not going to succeed in a role where all your actions are studied in detail by your admirers. Ask any parents.\n\n### Interaction Model\n\n#### Sensory input\n\nWe tend to think that our messages are perfectly clear, but you can generally assume something will be lost in every reception. The same applies when you are on the receiving end. You never get exactly what was sent.\n\nSo this steps gives you at least two ways of improving your ability to understand how people react to you: 1) you can develope your ability to see and hear more accurately, 2) you can choose to be aware of the possibility that someone may not be reacting to what you think they're reacting to.\n\n#### Interpretation\n\nAwareness of the interpretation step gives you two more new abilities: 1) you know that more than one interpretation is possible, 2) even when you think several interpretations, you can be aware that your list may not include the sender's interpretation.\n\n#### Feeling\n\nYou have the choice of being aware of the feeling, and differentiating if from other feelings. It can help keep things straight if you know whether you're angry or hurt or excited or scared, and to know that other people can have these feelings, even in response to you.\n\n#### Feeling about the feeling\n\nKnowing about survival rules makes you aware that people often respond to you based on experiences they had years ago. This understanding doesn't make their responses less real, but it does make it easier for you to deal with them effectively.\n\n#### Defence\n\nThe survival rule might suggest defence or not. It may be hard for you to believe that anyone needs to defend himself or herself against you, but you'd better believe it if you want to understand why your attempts at motivation don't always work.\n\n#### Rules for commenting\n\nPeople follow their rules for commenting differently. For instance, don't ever mention anger explicitly, but don't push men directly etc.\n\n#### Outcome\n\nThen the end result comes out. The cycle probably all happened in less than a second.\n\n### Understanding why communications go awry\n\nOver the different stage of transformation, the potential causes factors are\n\n- Perception\n- Wrong time - The transformation refers to things in the past or future, things that have no logical bearing on the present communication\n- Wrong place - Different Context\n- Wrong person - Referring to other people\n- Self-worth - My feelings about myself have a powerful influence on how I respond, but you have no direct access to how I feel about myself, either in general or right at this moment.\n\n### A way to start clearing communications\n\n> Tell them what you _perceive_, how you _feel_ about what you perceive, and if possible how you feel about that feeling.\n\nExamples\n\n1. \"Gee, I'mg having a hard time figuring that one out, and I'm feeling somewhat embarrassed to look dumb in front of you\"\n\n2. \"When I find myself asking you three times when you will finish this late assignment, I feel ashamed about acting like a dictator and not trusting you, yet I don't know how else to deal with my anxiety over the project schedule\"\n\n## Chapter 11. The second great obstacle to motivating others\n\n### Task-oriented, People-oriented and problem solving leader\n\n1. When survival is concerned, there's no choice but to put people first.\n2. If the job isn't highly technical, the leader need not be competent but can lead by fear.\n3. People with a strong technical background can convert any task into a technical task, thus avoiding work they don't want to do.\n4. Leaders who don't care about people don't have anyone to lead unless their followers don't have a choice.\n5. No amount of caring for people will hold your audience if you have nothing to offer but pretend you do.\n6. Task-oriented leader tends to overestimate their own accomplishments.\n7. Very Little work we do is really so important that it justifies sacrificing the future possibilities of the people doing the work.\n8. When the work is complex, no leader can be absolutely sure that plans won't's \"gaing aff agley\".\n9. To be a successful problem-solving leader, you must keep everybody's humanness at the forefront.\n10. If you are a leader, the people are your work. There is no other work worth doing.\n\n## Chapter 12. The problem of helping others\n\n1. Wanting to help people may be a noble motive but that doesn't ake if any easier.\n2. If people don't want your help, you'll never succeed in helping them, no matter how smart or wonderful you are.\n3. Effective help can only start with mutual agreement on a clear definition of the problem.\n4. Always check whether they want your help.\n5. Even when people agree that they want your help, that agreement is not usually a lifetime contract.\n6. People who want to help other people generally expect to get something for themselves, though they may not aware of it.\n7. Most people understand that helpers are selfish, but also think they are exceptions to the role.\n8. Attempts to help are often interpreted as attempts to interfere.\n9. No matter how strange it may look, most people are actually trying to be helpful.\n10. Offer to help your neighbour only if you would want to be helped in the same situation, and do it in the way you would want to be helped.\n\n## Chapter 13. Learning to be a motivator\n\n### Always be sincere\n\n### Transforming rules into guide\n\n1. State the rule clearly and explicitly. e.g I must always help everybody.\n2. Acknowledge the rule's survival value and strike a bargain with your unconscious mind.\n3. Give yourself a choice. e.g I can always help everybody (if I choose to)\n4. Change from certainty to possibility. e.g I can sometimes help everybody (if I choose to)\n5. Change the rule from totality to non-totality. e.g I can sometimes help some others (if I choose to)\n6. Change from general to particular. e.g I can help other people when ...\n\n### Becoming genuinely interested in other people\n\n## Chapter 14. Where power comes from\n\n- Power as a relationship\n- Power from technology\n- Expertise as power\n- Keeping power - what do you really want?\n\n## 15. Power, Imperfection, and Congruence\n\nMature patterns of behaviour\n\n- be clear when they deal with others\n- be aware of their own thoughts and feelings\n- be able to see and hear what is outside themselves\n- behave toward other people as separate from themselves and unique\n- treat differentness as an opportunity to learn and explore rather than as a threat or a signal for conflict\n- deal with persons and situations in their context, in terms of how it is rather than how they wish it were or expect it to be\n- accept responsibility for what they feel, think, hear, and see, rather than denying it or attributing it to others\n- have open techniques for giving, receiving, and checking meaning with others\n\n---\n","data":{"layout":"blog","title":"BOOK: Becoming A Technical Leader","date":"2019-01-30T00:00:00.000Z","thumbnail":"https://images-na.ssl-images-amazon.com/images/I/510T3Y9382L._SX327_BO1,204,203,200_.jpg","rating":"5","slug":"book-becoming-a-technical-leader"},"isEmpty":false,"excerpt":""}},"path":"blog/post/book-becoming-a-technical-leader"}
