{"template":"../src/containers/Post","sharedHashesByProp":{},"data":{"post":{"content":"\n# Career Development With Business Model Canvas\n\nResourece\nVideo: [Say goodbye to career planning: Tim Clark at TEDxPlainpalais](https://www.youtube.com/watch?v=JJsuWB3LQ_o)\n\nCanvas Example:\n\n![alt text](https://www.oreilly.com/library/view/business-model-you/9781118156315/images/ch003-f001.jpg \"Logo Title Text 1\")\n\nPersonal thoughts:\n\nWhen I jot down my canvas, I found the only resource I have is time, and the single value I can create is writing software. It rings a bell for me. It makes aware how vulnerable my business model is, how depends on the employer and how far I am from financial freedom.\n\nThere are two potential solutions I can think of.\n\nFirstly, taking full advantage of the esiting resource and \"re-sell\" it. Every day I am learning a lot of things, but what if I can structure it and re-sell it in the form of blog or video.\n\nSecondly, start to explore the new venue of the value stream. It was so powerful for me that, in the investment world,  you can make money by using the money. It is obvious that time is limited. Replying on time to create an income stream is not sustainable in the long term. Moreover, as time fly, it will become more and more valuable. Therefore, we need to use whatever we can to protect our time to be reserved with the most important thing.\n\n---\n\n# Tips to sell new language (e.g Rust)\n\n![alt text](https://doc.rust-lang.org/nomicon/img/safeandunsafe.svg \"Rust\")\n\n1. don't completely rewirte software in RUST. 1) Split out slice and use RUST. 2) Proxy out into RUST\n2. show up with code\n3. dont' sell\n4. sell sell sell - drop small cool stuff\n5. the hard part of programming isn't programming - it's about ecosystem\n6. the hard part of programming is programming\n7. be prepared for things to stay the same. 1) intorduce change slowly and mesaure impact as you go\n8. have a problem to solve\n9. learning curves are a blessing in disguise\n\nVideo Reference\n_Ashley Williams - How I Convinced the World's Largest Package Manager to Use Rust, and So Can You! [Link](https://www.youtube.com/watch?v=GCsxYAxw3JQ)_\n\n--\n\n# Proactively\n\nAsking forgiveness instead of asking permission\n\n# Fullfilling life - Tim Minchin\n\n- You don't have to have a dream\n- Don't seek happiness\n- It's all luck\n- Exercise\n- Be hard on your opinions\n- Be a teacher\n- Define yourself by what you love\n- Respect people with less power than you\n- Don't rush\n\n--\n","data":{"layout":"blog","title":"Perspectives and Ideas","date":"2019-02-14T00:00:00.000Z","thumbnail":"http://www.smallstepsbigchanges.com/wp-content/uploads/2013/10/perspective-hacks.png","rating":"5","slug":"perspectives-and-ideas"},"isEmpty":false,"excerpt":""}},"path":"blog/post/perspectives-and-ideas"}
